################################################################################
#
# Design name:  digital_top
#
# Created by icc2 write_sdc on Thu Aug 17 21:37:40 2023
#
################################################################################

set sdc_version 2.1
set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA

################################################################################
#
# Units
# time_unit               : 1e-09
# resistance_unit         : 1000
# capacitive_load_unit    : 1e-12
# voltage_unit            : 1
# current_unit            : 0.001
# power_unit              : 1e-09
################################################################################


# Mode: func
# Corner: ffg0p99vm40c
# Scenario: func_ffg0p99vm40c_bc

# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 9
create_clock -name PD_SCL -period 1000 -waveform {0 500} [get_ports {PD_SCL}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 10
create_clock -name AD_OSC -period 333 -waveform {0 166} [get_ports {AD_OSC}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 95
set_clock_groups -name PD_SCL_1 -asynchronous -group [get_clocks {PD_SCL}] -group [get_clocks {AD_OSC}]
set_propagated_clock [get_clocks {PD_SCL}]
set_propagated_clock [get_clocks {AD_OSC}]
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile0_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile1_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile2_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile3_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile4_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile5_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile6_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le0/regfile7_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile0_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile1_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile2_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile3_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile4_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile5_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile6_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le1/regfile7_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile0_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile1_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile2_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile3_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile4_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile5_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile6_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le2/regfile7_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile0_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile1_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile2_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile3_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile4_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile5_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile6_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_7_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_6_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_5_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_4_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_3_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_2_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_1_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_0_}]  
set_disable_timing -from CDN -to Q [get_cells {i2c/i2c_mem/rf_1r1w_le3/regfile7_reg_0_}]  
set_disable_timing -from B1 -to ZN [get_cells {U634}]  
set_disable_timing -from A1 -to ZN [get_cells {U634}]  
set_disable_timing -from B2 -to ZN [get_cells {U634}]  
set_disable_timing -from C -to ZN [get_cells {U637}]  
set_disable_timing -from B -to ZN [get_cells {U637}]  
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 11
group_path -name FEEDTHROUGH -from [get_ports {VDD VPP VSS POR EM_RESET PD_SDA_IN AD_PGood AD_OVP AD_OCP AD_OTP AD_ADDR[1] AD_ADDR[0] AD_ADDR_RDY AD_ENable AD_SS_DONE}] -to [get_ports {DP_SDA_OUT DP_SDA_OE TM_SCALE[1] TM_SCALE[0] TM_OCSET[4] TM_OCSET[3] TM_OCSET[2] TM_OCSET[1] TM_OCSET[0] TM_RAMP[3] TM_RAMP[2] TM_RAMP[1] TM_RAMP[0] TM_BG[5] TM_BG[4] TM_BG[3] TM_BG[2] TM_BG[1] TM_BG[0] TM_OSC[3] TM_OSC[2] TM_OSC[1] TM_OSC[0] TM_Drv_Delay[1] TM_Drv_Delay[0] TM_RDB[1] TM_RDB[0] TM_Toffmin TM_FSW[4] TM_FSW[3] TM_FSW[2] TM_FSW[1] TM_FSW[0] TM_dcm_ramp[1] TM_dcm_ramp[0] TM_Both_drivers_off TM_Both_drivers_on TM_HD_ON TM_LD_ON TM_OSC_TEST TM_OC_TRIM DA_DAC[8] DA_DAC[7] DA_DAC[6] DA_DAC[5] DA_DAC[4] DA_DAC[3] DA_DAC[2] DA_DAC[1] DA_DAC[0] DA_OCSET[2] DA_OCSET[1] DA_OCSET[0] DA_SS_RATE DA_PGOOD_MODE DA_DCM DA_OV_threshold[1] DA_OV_threshold[0] DA_PG_threshold[1] DA_PG_threshold[0] DA_OT_threshold[1] DA_OT_threshold[0] DA_bus_voltage DA_Enable DA_OV_response DA_SCTRLB DA_RAMP_DONE DA_INITIALIZED DA_OSC_EN DA_NCL_EN DA_MEM_WRITE_MODE}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 12
group_path -name REG2REG -from [get_clocks {PD_SCL AD_OSC}] -to [get_clocks {PD_SCL AD_OSC}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 13
group_path -name REGIN -from [get_ports {VDD VPP VSS POR EM_RESET PD_SDA_IN AD_PGood AD_OVP AD_OCP AD_OTP AD_ADDR[1] AD_ADDR[0] AD_ADDR_RDY AD_ENable AD_SS_DONE}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 14
group_path -name REGOUT -to [get_ports {DP_SDA_OUT DP_SDA_OE TM_SCALE[1] TM_SCALE[0] TM_OCSET[4] TM_OCSET[3] TM_OCSET[2] TM_OCSET[1] TM_OCSET[0] TM_RAMP[3] TM_RAMP[2] TM_RAMP[1] TM_RAMP[0] TM_BG[5] TM_BG[4] TM_BG[3] TM_BG[2] TM_BG[1] TM_BG[0] TM_OSC[3] TM_OSC[2] TM_OSC[1] TM_OSC[0] TM_Drv_Delay[1] TM_Drv_Delay[0] TM_RDB[1] TM_RDB[0] TM_Toffmin TM_FSW[4] TM_FSW[3] TM_FSW[2] TM_FSW[1] TM_FSW[0] TM_dcm_ramp[1] TM_dcm_ramp[0] TM_Both_drivers_off TM_Both_drivers_on TM_HD_ON TM_LD_ON TM_OSC_TEST TM_OC_TRIM DA_DAC[8] DA_DAC[7] DA_DAC[6] DA_DAC[5] DA_DAC[4] DA_DAC[3] DA_DAC[2] DA_DAC[1] DA_DAC[0] DA_OCSET[2] DA_OCSET[1] DA_OCSET[0] DA_SS_RATE DA_PGOOD_MODE DA_DCM DA_OV_threshold[1] DA_OV_threshold[0] DA_PG_threshold[1] DA_PG_threshold[0] DA_OT_threshold[1] DA_OT_threshold[0] DA_bus_voltage DA_Enable DA_OV_response DA_SCTRLB DA_RAMP_DONE DA_INITIALIZED DA_OSC_EN DA_NCL_EN DA_MEM_WRITE_MODE}]
# /home/pd.group9/nikhil/ICC2-RM_T-2022.03-SP4/func1.tcl, line 110
set_operating_conditions -library tcbn28hpcplusbwp12t30p140ffg0p99vm40c_ccs -analysis_type on_chip_variation ffg0p99vm40c
# Warning: Libcell power domain derates are skipped!

# /home/pd.group9/nikhil/ICC2-RM_T-2022.03-SP4/func1.tcl, line 110
set_timing_derate -early 0.968 -cell_delay -clock [current_design]
# /home/pd.group9/nikhil/ICC2-RM_T-2022.03-SP4/func1.tcl, line 110
set_timing_derate -late 1.032 -cell_delay -clock [current_design]
# /home/pd.group9/nikhil/ICC2-RM_T-2022.03-SP4/func1.tcl, line 110
set_timing_derate -early 0.968 -cell_delay -data [current_design]
# /home/pd.group9/nikhil/ICC2-RM_T-2022.03-SP4/func1.tcl, line 110
set_timing_derate -late 1.071 -cell_delay -data [current_design]
set_timing_derate -early 0.94 -net_delay -clock 
set_timing_derate -late 1.06 -net_delay -clock 
set_timing_derate -early 0.94 -net_delay -data 
set_timing_derate -late 1.06 -net_delay -data 
# Set latency for io paths.
# -origin useful_skew
set_clock_latency -min 0.0259495 [get_clocks {AD_OSC}]
# -origin useful_skew
set_clock_latency -max 0.0304413 [get_clocks {AD_OSC}]
# Set propagated on clock sources to avoid removing latency for IO paths.
set_propagated_clock  [get_ports {AD_OSC}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 15
set_input_delay -clock [get_clocks {AD_OSC}] 66 [get_ports {PD_SDA_IN}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 16
set_input_delay -clock [get_clocks {AD_OSC}] 66 [get_ports {AD_PGood}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 17
set_input_delay -clock [get_clocks {AD_OSC}] 66 [get_ports {AD_OVP}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 18
set_input_delay -clock [get_clocks {AD_OSC}] 66 [get_ports {AD_OCP}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 19
set_input_delay -clock [get_clocks {AD_OSC}] 66 [get_ports {AD_OTP}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 20
set_input_delay -clock [get_clocks {AD_OSC}] 66 [get_ports {AD_ADDR[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 21
set_input_delay -clock [get_clocks {AD_OSC}] 66 [get_ports {AD_ADDR[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 22
set_input_delay -clock [get_clocks {AD_OSC}] 66 [get_ports {AD_ADDR_RDY}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 23
set_input_delay -clock [get_clocks {AD_OSC}] 66 [get_ports {AD_ENable}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 24
set_input_delay -clock [get_clocks {AD_OSC}] 66 [get_ports {AD_SS_DONE}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 25
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DP_SDA_OUT}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 26
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DP_SDA_OE}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 27
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_SCALE[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 28
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_SCALE[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 29
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_OCSET[4]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 30
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_OCSET[3]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 31
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_OCSET[2]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 32
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_OCSET[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 33
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_OCSET[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 34
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_RAMP[3]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 35
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_RAMP[2]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 36
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_RAMP[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 37
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_RAMP[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 38
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_BG[5]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 39
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_BG[4]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 40
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_BG[3]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 41
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_BG[2]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 42
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_BG[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 43
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_BG[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 44
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_OSC[3]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 45
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_OSC[2]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 46
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_OSC[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 47
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_OSC[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 48
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_Drv_Delay[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 49
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_Drv_Delay[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 50
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_RDB[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 51
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_RDB[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 52
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_Toffmin}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 53
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_FSW[4]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 54
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_FSW[3]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 55
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_FSW[2]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 56
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_FSW[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 57
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_FSW[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 58
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_dcm_ramp[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 59
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_dcm_ramp[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 60
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_Both_drivers_off}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 61
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_Both_drivers_on}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 62
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_HD_ON}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 63
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_LD_ON}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 64
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {TM_OC_TRIM}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 65
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_DAC[8]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 66
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_DAC[7]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 67
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_DAC[6]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 68
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_DAC[5]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 69
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_DAC[4]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 70
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_DAC[3]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 71
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_DAC[2]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 72
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_DAC[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 73
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_DAC[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 74
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_OCSET[2]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 75
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_OCSET[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 76
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_OCSET[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 77
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_SS_RATE}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 78
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_PGOOD_MODE}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 79
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_DCM}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 80
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_OV_threshold[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 81
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_OV_threshold[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 82
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_PG_threshold[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 83
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_PG_threshold[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 84
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_OT_threshold[1]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 85
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_OT_threshold[0]}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 86
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_bus_voltage}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 87
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_Enable}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 88
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_OV_response}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 89
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_SCTRLB}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 90
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_RAMP_DONE}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 91
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_INITIALIZED}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 92
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_OSC_EN}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 93
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_NCL_EN}]
# /home/dipesh.panchal/DC_Scripts/results/digital_top.mapped.sdc, line 94
set_output_delay -clock [get_clocks {AD_OSC}] 100 [get_ports {DA_MEM_WRITE_MODE}]
set_max_transition 0.25 [current_design]
set_max_transition 0.15 [get_clocks {PD_SCL}] -clock_path
set_max_transition 0.15 [get_clocks {AD_OSC}] -clock_path
